frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/bpm.h
#define BPM_ISR_PSOK_Pos            0            /**< \brief (BPM_ISR) Power Scaling OK Interrupt Status */
#define BPM_ISR_PSOK                (_U(0x1) << BPM_ISR_PSOK_Pos)
#define BPM_ISR_AE_Pos              31           /**< \brief (BPM_ISR) Access Error Interrupt Status */
#define BPM_ISR_AE                  (_U(0x1) << BPM_ISR_AE_Pos)
#define BPM_ISR_MASK                _U(0x80000001) /**< \brief (BPM_ISR) MASK Register */

/* -------- BPM_ICR : (BPM Offset: 0x10) ( /W 32) Interrupt Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PSOK:1;           /*!< bit:      0  Power Scaling OK Interrupt Status Clear */
    uint32_t :30;              /*!< bit:  1..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error Interrupt Status Clear */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BPM_ICR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BPM_ICR_OFFSET              0x10         /**< \brief (BPM_ICR offset) Interrupt Clear Register */
#define BPM_ICR_RESETVALUE          _U(0x00000000); /**< \brief (BPM_ICR reset_value) Interrupt Clear Register */

#define BPM_ICR_PSOK_Pos            0            /**< \brief (BPM_ICR) Power Scaling OK Interrupt Status Clear */
#define BPM_ICR_PSOK                (_U(0x1) << BPM_ICR_PSOK_Pos)
#define BPM_ICR_AE_Pos              31           /**< \brief (BPM_ICR) Access Error Interrupt Status Clear */
#define BPM_ICR_AE                  (_U(0x1) << BPM_ICR_AE_Pos)
#define BPM_ICR_MASK                _U(0x80000001) /**< \brief (BPM_ICR) MASK Register */

/* -------- BPM_SR : (BPM Offset: 0x14) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PSOK:1;           /*!< bit:      0  Power Scaling OK Status            */
    uint32_t :30;              /*!< bit:  1..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BPM_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BPM_SR_OFFSET               0x14         /**< \brief (BPM_SR offset) Status Register */
#define BPM_SR_RESETVALUE           _U(0x00000000); /**< \brief (BPM_SR reset_value) Status Register */

#define BPM_SR_PSOK_Pos             0            /**< \brief (BPM_SR) Power Scaling OK Status */
#define BPM_SR_PSOK                 (_U(0x1) << BPM_SR_PSOK_Pos)
#define BPM_SR_AE_Pos               31           /**< \brief (BPM_SR) Access Error */
#define BPM_SR_AE                   (_U(0x1) << BPM_SR_AE_Pos)
#define BPM_SR_MASK                 _U(0x80000001) /**< \brief (BPM_SR) MASK Register */

/* -------- BPM_UNLOCK : (BPM Offset: 0x18) ( /W 32) Unlock Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADDR:10;          /*!< bit:  0.. 9  Unlock Address                     */
    uint32_t :14;              /*!< bit: 10..23  Reserved                           */
    uint32_t KEY:8;            /*!< bit: 24..31  Unlock Key                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BPM_UNLOCK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BPM_UNLOCK_OFFSET           0x18         /**< \brief (BPM_UNLOCK offset) Unlock Register */
#define BPM_UNLOCK_RESETVALUE       _U(0x00000000); /**< \brief (BPM_UNLOCK reset_value) Unlock Register */

#define BPM_UNLOCK_ADDR_Pos         0            /**< \brief (BPM_UNLOCK) Unlock Address */
#define BPM_UNLOCK_ADDR_Msk         (_U(0x3FF) << BPM_UNLOCK_ADDR_Pos)
#define BPM_UNLOCK_ADDR(value)      (BPM_UNLOCK_ADDR_Msk & ((value) << BPM_UNLOCK_ADDR_Pos))
#define BPM_UNLOCK_KEY_Pos          24           /**< \brief (BPM_UNLOCK) Unlock Key */
#define BPM_UNLOCK_KEY_Msk          (_U(0xFF) << BPM_UNLOCK_KEY_Pos)
#define BPM_UNLOCK_KEY(value)       (BPM_UNLOCK_KEY_Msk & ((value) << BPM_UNLOCK_KEY_Pos))
#define BPM_UNLOCK_MASK             _U(0xFF0003FF) /**< \brief (BPM_UNLOCK) MASK Register */

/* -------- BPM_PMCON : (BPM Offset: 0x1C) (R/W 32) Power Mode Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PS:2;             /*!< bit:  0.. 1  Power Scaling Configuration Value  */
    uint32_t PSCREQ:1;         /*!< bit:      2  Power Scaling Change Request       */
    uint32_t PSCM:1;           /*!< bit:      3  Power Scaling Change Mode          */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t BKUP:1;           /*!< bit:      8  BACKUP Mode                        */
    uint32_t RET:1;            /*!< bit:      9  RETENTION Mode                     */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t SLEEP:2;          /*!< bit: 12..13  SLEEP mode Configuration           */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t CK32S:1;          /*!< bit:     16  32Khz-1Khz Clock Source Selection  */
    uint32_t :7;               /*!< bit: 17..23  Reserved                           */
    uint32_t FASTWKUP:1;       /*!< bit:     24  Fast Wakeup                        */
    uint32_t :7;               /*!< bit: 25..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BPM_PMCON_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BPM_PMCON_OFFSET            0x1C         /**< \brief (BPM_PMCON offset) Power Mode Control Register */
#define BPM_PMCON_RESETVALUE        _U(0x00000000); /**< \brief (BPM_PMCON reset_value) Power Mode Control Register */

#define BPM_PMCON_PS_Pos            0            /**< \brief (BPM_PMCON) Power Scaling Configuration Value */
#define BPM_PMCON_PS_Msk            (_U(0x3) << BPM_PMCON_PS_Pos)
#define BPM_PMCON_PS(value)         (BPM_PMCON_PS_Msk & ((value) << BPM_PMCON_PS_Pos))
#define BPM_PMCON_PSCREQ_Pos        2            /**< \brief (BPM_PMCON) Power Scaling Change Request */
#define BPM_PMCON_PSCREQ            (_U(0x1) << BPM_PMCON_PSCREQ_Pos)
#define BPM_PMCON_PSCM_Pos          3            /**< \brief (BPM_PMCON) Power Scaling Change Mode */
#define BPM_PMCON_PSCM              (_U(0x1) << BPM_PMCON_PSCM_Pos)
#define BPM_PMCON_BKUP_Pos          8            /**< \brief (BPM_PMCON) BACKUP Mode */
#define BPM_PMCON_BKUP              (_U(0x1) << BPM_PMCON_BKUP_Pos)
#define BPM_PMCON_RET_Pos           9            /**< \brief (BPM_PMCON) RETENTION Mode */
#define BPM_PMCON_RET               (_U(0x1) << BPM_PMCON_RET_Pos)
#define BPM_PMCON_SLEEP_Pos         12           /**< \brief (BPM_PMCON) SLEEP mode Configuration */
#define BPM_PMCON_SLEEP_Msk         (_U(0x3) << BPM_PMCON_SLEEP_Pos)
#define BPM_PMCON_SLEEP(value)      (BPM_PMCON_SLEEP_Msk & ((value) << BPM_PMCON_SLEEP_Pos))
#define BPM_PMCON_CK32S_Pos         16           /**< \brief (BPM_PMCON) 32Khz-1Khz Clock Source Selection */
#define BPM_PMCON_CK32S             (_U(0x1) << BPM_PMCON_CK32S_Pos)
#define BPM_PMCON_FASTWKUP_Pos      24           /**< \brief (BPM_PMCON) Fast Wakeup */
#define BPM_PMCON_FASTWKUP          (_U(0x1) << BPM_PMCON_FASTWKUP_Pos)
#define BPM_PMCON_MASK              _U(0x0101330F) /**< \brief (BPM_PMCON) MASK Register */

/* -------- BPM_BKUPWCAUSE : (BPM Offset: 0x28) (R/  32) Backup Wake up Cause Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} BPM_BKUPWCAUSE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BPM_BKUPWCAUSE_OFFSET       0x28         /**< \brief (BPM_BKUPWCAUSE offset) Backup Wake up Cause Register */
#define BPM_BKUPWCAUSE_RESETVALUE   _U(0x00000000); /**< \brief (BPM_BKUPWCAUSE reset_value) Backup Wake up Cause Register */
#define BPM_BKUPWCAUSE_MASK         _U(0xFFFFFFFF) /**< \brief (BPM_BKUPWCAUSE) MASK Register */

